In [ ]:
# You have  to apply First of all encoding all 
# types then using labelencooder you have to apply standardization and normalization and 
# then you have to create a pipeline of this .

In [20]:
import pandas as pd
import numpy as np

In [21]:
df = pd.read_csv("Social_Network_Ads.csv")
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

In [22]:
#df.isnull().sum()

# label encoding

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
lb = LabelEncoder()

In [25]:
df['Gender'] = lb.fit_transform(df['Gender'])

In [26]:
x = df.drop(columns = ['Purchased'])
y = df['Purchased']

In [27]:
from sklearn.model_selection import train_test_split

In [28]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.2,random_state=42)

# standardrisation

In [29]:
from sklearn.preprocessing import StandardScaler

In [30]:
sc = StandardScaler()

In [31]:
x_train_sc= sc.fit_transform(x_train)

In [32]:
x_train_new = pd.DataFrame(x_train_sc , columns = x_train.columns)

In [33]:
np.round(x_train_new.describe() , 2)

       User ID  Gender     Age  EstimatedSalary
count   320.00   320.0  320.00           320.00
mean      0.00     0.0   -0.00             0.00
std       1.00     1.0    1.00             1.00
min      -1.66    -1.0   -1.95            -1.61
25%      -0.92    -1.0   -0.77            -0.79
50%       0.01     0.0   -0.09             0.02
75%       0.81     1.0    0.70             0.52
max       1.76     1.0    2.17             2.32

# normalisation

In [34]:
from sklearn.preprocessing import MinMaxScaler

In [35]:
mn = MinMaxScaler()

In [36]:
x_train_mn = mn.fit_transform(x_train)

In [37]:
x_train_new = pd.DataFrame(x_train_mn , columns = x_train.columns)

In [38]:
np.round(x_train_new.describe() ,2 )

       User ID  Gender     Age  EstimatedSalary
count   320.00   320.0  320.00           320.00
mean      0.49     0.5    0.47             0.41
std       0.29     0.5    0.24             0.26
min       0.00     0.0    0.00             0.00
25%       0.22     0.0    0.29             0.21
50%       0.49     0.5    0.45             0.41
75%       0.72     1.0    0.64             0.54
max       1.00     1.0    1.00             1.00

# ordinal encoding

In [44]:
df = pd.read_csv("Social_Network_Ads.csv")
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

In [45]:
from sklearn.preprocessing import OrdinalEncoder

In [75]:
data = np.array(['Gender']).reshape(-1, 1) 
oe = OrdinalEncoder(categories=[['Gender']])

In [77]:
oe_sc = oe.fit_transform(data)

In [78]:
oe_sc

array([[0.]])

# onehot encoding

In [54]:
df = pd.read_csv("Social_Network_Ads.csv")
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

In [55]:
from sklearn.preprocessing import OneHotEncoder

In [56]:
ohe = OneHotEncoder(drop = 'first' , sparse_output = False , dtype = np.int32)

In [58]:
df_new = ohe.fit_transform(df[['Gender']])

In [52]:
df_new

array([[1],
       [1],
       [1],
       [0],
       [0],
       [0],
       [1],
       [0],
       [0],
       [0],
       [0],
       [0],
       [0],
       [1],
       [1],
       [1],
       [0],
       [0],
       [0],
       [0],
       [1],
       [1],
       [0],
       [0],
       [0],
       [1],
       [0],
       [0],
       [1],
       [0],
       [1],
       [1],
       [0],
       [0],
       [1],
       [0],
       [0],
       [1],
       [0],
       [0],
       [0],
       [1],
       [1],
       [0],
       [1],
       [1],
       [0],
       [0],
       [1],
       [1],
       [1],
       [0],
       [0],
       [1],
       [0],
       [0],
       [1],
       [0],
       [1],
       [0],
       [0],
       [0],
       [0],
       [1],
       [1],
       [0],
       [1],
       [1],
       [0],
       [0],
       [0],
       [0],
       [0],
       [1],
       [0],
       [1],
       [1],
       [0],
       [1],
       [0],
       [0],
       [1],
       [1],
       [0],
       [0],
       [0],
       [1],
       [1],
       [0],
       [1],
       [0],
       [1],
       [0],
       [1],
       [1],
       [0],
       [0],
       [0],
       [0],
       [0]], dtype=int32)

# get dummies

In [59]:
df = pd.read_csv("Social_Network_Ads.csv")
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

In [60]:
df_new = pd.get_dummies(df , drop_first =True , columns = ['Gender'])

In [61]:
df_new.astype(int)

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

# pipeline

In [62]:
df = pd.read_csv("Social_Network_Ads.csv")
df.head(3)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0

In [63]:
from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline
from sklearn.preprocessing import StandardScaler, OneHotEncoder
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [64]:
X = df.drop(columns = ['Purchased'])
y = df['Purchased']
X_train , X_test , y_train , y_test = train_test_split(X,y, test_size=0.2,random_state=42)

In [65]:
categorical_features = ['Gender']
numeric_features = ['User ID','Age','EstimatedSalary']

In [66]:
# create transformers
numeric_transformer = Pipeline(steps=[
    ('scaler' , StandardScaler())
])

categorical_transformer =  Pipeline(steps=[
    ('onehot' ,OneHotEncoder(handle_unknown='ignore'))
])

# combine transformers
preprocessor = ColumnTransformer(
    transformers=[
        ('num', numeric_transformer, numeric_features),
        ('cat', categorical_transformer, categorical_features)
    ])

# create the pipeline

clf = Pipeline(steps=[('preprocessor' , preprocessor),
                      ('classifier', LogisticRegression())])

# train the model
clf.fit(X_train, y_train)

# Evaluate the model
y_pred = clf.predict(X_test)

In [67]:
from sklearn.metrics import accuracy_score

In [68]:
acc = accuracy_score(y_test , y_pred)

In [69]:
acc

0.8875